#ifndef __APP_T5L_CFG_H__
#define __APP_T5L_CFG_H__

/*******************************************************************************
 * Includes
 ******************************************************************************/
#include "typedefine.h"
#include "app_t5l_ctrl.h"

/*******************************************************************************
 * Definitions
 ******************************************************************************/

//=====================================================================================================================
//屏幕的描述指针地址范围：
//0x9010~0x9100：重量显示控件
//0x9110~0x9160：帮助信息的差值显示控件
//0x9210~0x9300：托盘序号显示控件
//0x9310~0x9400：托盘背景色显示控件
//=====================================================================================================================

//=========================================================================================
//=========================================================================================
//=========================================================================================
//===================================[15.6寸 16头]==========================================
//=========================================================================================
//=========================================================================================
//=========================================================================================
//=========================================================================================
//=============================================15.6寸屏的【托盘重量】描述指针=============================================
//大屏幕的描述指针：显示托盘的重量控件
extern INT16 describlePointWeightVluAdd_Larger[T5L_MAX_CHANEL_LEN];
extern INT16 describlePointWeightVluWuXiaoShu_Larger[T5L_MAX_CHANEL_LEN][6];
extern INT16 describlePointWeightVluYouXiaoShu_Larger[T5L_MAX_CHANEL_LEN][6];
//=============================================15.6寸屏的【托盘序号】描述指针=============================================
//托盘的序号显示
extern INT16 describlePointWeightIndexAdd_Larger[T5L_MAX_CHANEL_LEN];
extern INT16 describlePointWeightIndex_Larger[T5L_MAX_CHANEL_LEN][6];
//=============================================15.6寸屏的【帮助差值】描述指针=============================================
extern INT16 describlePointHelpVluAdd_Larger[T5L_L_HELP_TOTAL_NUM];
extern INT16 describlePointHelpVluWuXiaoShu_Larger[T5L_L_HELP_TOTAL_NUM][6];
extern INT16 describlePointHelpVluYouXiaoShu_Larger[T5L_L_HELP_TOTAL_NUM][6];
//=============================================15.6寸屏的【托盘的背景色】描述指针=============================================
extern INT16 describlePointWeightColorAdd_Larger[T5L_MAX_CHANEL_LEN];
extern INT16 describlePointWeightColor_Larger[T5L_MAX_CHANEL_LEN][2];


//=========================================================================================
//=========================================================================================
//=========================================================================================
//===================================[15.6寸 8头]==========================================
//=========================================================================================
//=========================================================================================
//=========================================================================================
//=========================================================================================
//=============================================15.6寸屏的【托盘重量】描述指针=============================================
//大屏幕的描述指针：显示托盘的重量控件
extern INT16 describlePointWeightVluAdd_Larger_8[T5L_MAX_CHANEL_LEN];
extern INT16 describlePointWeightVluWuXiaoShu_Larger_8[T5L_MAX_CHANEL_LEN][6];
extern INT16 describlePointWeightVluYouXiaoShu_Larger_8[T5L_MAX_CHANEL_LEN][6];
//=============================================15.6寸屏的【托盘序号】描述指针=============================================
//托盘的序号显示
extern INT16 describlePointWeightIndexAdd_Larger_8[T5L_MAX_CHANEL_LEN];
extern INT16 describlePointWeightIndex_Larger_8[T5L_MAX_CHANEL_LEN][6];
//=============================================15.6寸屏的【帮助差值】描述指针=============================================
extern INT16 describlePointHelpVluAdd_Larger_8[T5L_L_HELP_TOTAL_NUM];
extern INT16 describlePointHelpVluWuXiaoShu_Larger_8[T5L_L_HELP_TOTAL_NUM][6];
extern INT16 describlePointHelpVluYouXiaoShu_Larger_8[T5L_L_HELP_TOTAL_NUM][6];
//=============================================15.6寸屏的【托盘的背景色】描述指针=============================================
extern INT16 describlePointWeightColorAdd_Larger_8[T5L_MAX_CHANEL_LEN];
extern INT16 describlePointWeightColor_Larger_8[T5L_MAX_CHANEL_LEN][2];







//=============================================8.8寸屏的【托盘的重量】描述指针=============================================
//屏幕的描述指针：显示托盘的重量控件
extern INT16 describlePointAdd[HX711_CHANEL_NUM];
//托盘的重量显示：不带小数点显示
extern INT16 describlePointVluWuXiaoShu[HX711_CHANEL_NUM][6];
//托盘的重量显示：带小数点显示
extern INT16 describlePointVluXiaoShu[HX711_CHANEL_NUM][6];

//================================================================================================
//屏幕的描述指针：托盘序号控件
extern INT16 describleIndexPointAdd[HX711_CHANEL_NUM];
extern INT16 describleIndexPointData[HX711_CHANEL_NUM][6];

//================================================================================================
//屏幕的描述指针：帮助信息控件
//帮助信息：不带小数显示
extern INT16 describlePointAdd_help[DESCRIBLE_POINT_HELP_NUM];
extern INT16 describlePointVluWuXiaoShu_help[DESCRIBLE_POINT_HELP_NUM][6];
//帮助信息：带小数显示
extern INT16 describlePointVluXiaoShu_help[DESCRIBLE_POINT_HELP_NUM][6];

#endif
